danielguy91/Velocista/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*! @name PORTC17 (number 91), J1[4]
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_TMR_1588_1_PORT PORTC                /*!<@brief PORT peripheral base pointer */
#define BOARD_TMR_1588_1_PIN 17U                   /*!<@brief PORT pin number */
#define BOARD_TMR_1588_1_PIN_MASK (1U << 17U)      /*!<@brief PORT pin mask */
                                                   /* @} */

/*! @name PORTC16 (number 90), J1[2]
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_TMR_1588_0_PORT PORTC                /*!<@brief PORT peripheral base pointer */
#define BOARD_TMR_1588_0_PIN 16U                   /*!<@brief PORT pin number */
#define BOARD_TMR_1588_0_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                                   /* @} */

/*! @name PORTA1 (number 35), J1[8]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_PTA1_GPIO GPIOA               /*!<@brief GPIO peripheral base pointer */
#define BOARD_PTA1_GPIO_PIN_MASK (1U << 1U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_PTA1_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define BOARD_PTA1_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_PTA1_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                            /* @} */

/*! @name PORTB2 (number 55), J4[2]
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_ADC0_SE12_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_ADC0_SE12_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_ADC0_SE12_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                 /* @} */

/*! @name PORTD0 (number 93), J2[6]
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_PWM_10_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_PWM_10_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_PWM_10_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name PORTD2 (number 95), J2[8]
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_PWM_11_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_PWM_11_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_PWM_11_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name PORTD3 (number 96), J2[10]
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_PWM_20_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_PWM_20_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_PWM_20_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name PORTD1 (number 94), J2[12]
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_PWM_21_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_PWM_21_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_PWM_21_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

/*! @name PORTC6 (number 78), U8[11]/SW2
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_SW2_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define BOARD_SW2_GPIO_PIN_MASK (1U << 6U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_SW2_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_SW2_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_SW2_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                           /* @} */

/*! @name PORTA4 (number 38), SW3
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_SW3_GPIO GPIOA               /*!<@brief GPIO peripheral base pointer */
#define BOARD_SW3_GPIO_PIN_MASK (1U << 4U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_SW3_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define BOARD_SW3_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_SW3_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                           /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitButtonsPins(void);

/*! @name PORTB21 (number 67), D12[3]/LEDRGB_BLUE
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_LED_BLUE_GPIO GPIOB                /*!<@brief GPIO peripheral base pointer */
#define BOARD_LED_BLUE_GPIO_PIN_MASK (1U << 21U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_LED_BLUE_PORT PORTB                /*!<@brief PORT peripheral base pointer */
#define BOARD_LED_BLUE_PIN 21U                   /*!<@brief PORT pin number */
#define BOARD_LED_BLUE_PIN_MASK (1U << 21U)      /*!<@brief PORT pin mask */
                                                 /* @} */

/*! @name PORTB22 (number 68), D12[1]/LEDRGB_RED
  @{ */

